ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/***************************************************************************//**
* \file cy_ble_hids.c
* \version 2.0
*
* \brief
*  Contains the source code for the HID service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"
/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_HIDS))

static cy_ble_callback_t Cy_BLE_HIDS_ApplCallback;

#ifdef CY_BLE_HIDS_SERVER
/* Local function prototypes */
static uint32_t Cy_BLE_HIDSS_CccdWriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
#endif /* CY_BLE_HIDS_SERVER */

#ifdef CY_BLE_HIDS_CLIENT
/* HIDS Center Service characteristics GATT DB handles structure */
cy_stc_ble_hidsc_t cy_ble_hidsc[CY_BLE_CONFIG_GATTC_COUNT][CY_BLE_HIDSC_SERVICE_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_hidscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

uint8_t cy_ble_hidscServiceCount[CY_BLE_CONFIG_GATTC_COUNT];

/* To discovery descriptors for multiple HID service instances */
uint8_t cy_ble_hidscDisServiceIndex[CY_BLE_CONFIG_GATTC_COUNT];
#endif /* CY_BLE_HIDS_CLIENT */

/* The pointer on global BLE HIDS Config structure */
cy_stc_ble_hids_config_t *cy_ble_hidsConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_HIDS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_HIDSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_HIDSS_OnDeviceConnected(void);
#endif /* CY_BLE_HIDS_SERVER */

#ifdef CY_BLE_HIDS_CLIENT
static void Cy_BLE_HIDSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_HIDSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_HIDSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_HIDSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_HIDSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_HIDSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_HIDSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
static void Cy_BLE_HIDSC_InclDiscoveryEventHandler(const cy_stc_ble_disc_incl_info_t *discInclInfo);
#endif /* CY_BLE_HIDS_CLIENT */
static cy_en_ble_gatt_err_code_t Cy_BLE_HIDS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_HIDS_Init
***************************************************************************//**
*
*  This function initializes the HID Service.
*
*  \param config: Configuration structure for the HID Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDS_Init(cy_stc_ble_hids_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_hidsConfigPtr = config;

        /* Registers Event Handler for the HID Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_HIDS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_hidsConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_HIDS_ApplCallback = cy_ble_hidsConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_HIDS_CLIENT
        {
            uint32_t idx;
            uint32_t locServIndex;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                for(locServIndex = 0u; locServIndex < CY_BLE_HIDSC_SERVICE_COUNT; locServIndex++)
                {
                    if(cy_ble_serverInfo[idx][CY_BLE_SRVI_HIDS + locServIndex].range.startHandle ==
                       CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                    {
                        (void)memset(&cy_ble_hidsc[idx][locServIndex], 0, sizeof(cy_stc_ble_hidsc_t));

                        /* initialize uuid  */
                        cy_ble_serverInfo[idx][CY_BLE_SRVI_HIDS + locServIndex].uuid = CY_BLE_UUID_HIDS_SERVICE;
                    }
                }
                cy_ble_hidscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;

                cy_ble_hidscServiceCount[idx] = 0u;
            }
        }
    #endif /* CY_BLE_HIDS_CLIENT */
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service-specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc: An application layer event callback function to receive
*                    events from the BLE Component. The definition of
*                    cy_ble_callback_t for HID Service is:\n
*                    typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                       void *eventParam)
*                    * eventCode indicates the event that triggered this
*                      callback (e.g. CY_BLE_EVT_HIDS_NOTIFICATION_ENABLED).
*                    * eventParam contains the parameters corresponding to the
*                      current event. (e.g. pointer to cy_stc_ble_hids_char_value_t
*                      structure that contains details of the characteristic for
*                      which notification enabled event was triggered).
*
*
* \sideeffect The *eventParams in the callback function should not be used by
*                the application once the callback function execution is finished.
*                Otherwise this data may become corrupted.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_HIDS_ApplCallback = callbackFunc;
    if(cy_ble_hidsConfigPtr != NULL)
    {
        cy_ble_hidsConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_HIDS_SERVER


