ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/******************************************************************************
* Function Name: Cy_BLE_HIDSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets local characteristic value of the specified HID Service characteristics.
*
*  \param serviceIndex: The index of the service instance. e.g. If two HID Services are
*                 supported in your design, then first service will be identified
*                 by serviceIndex of 0 and the second by serviceIndex of 1.
*  \param charIndex: The index of a service characteristic.
*              * CY_BLE_HIDS_PROTOCOL_MODE - Protocol Mode characteristic
*              * CY_BLE_HIDS_REPORT_MAP - Report Map characteristic
*              * CY_BLE_HIDS_INFORMATION - HID Information characteristic
*              * CY_BLE_HIDS_CONTROL_POINT - HID Control Point characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_IN_REP - Boot Keyboard Input Report Characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_OUT_REP - Boot Keyboard Output Report Characteristic
*              * CY_BLE_HIDS_BOOT_MOUSE_IN_REP - Boot Mouse Input Report Characteristic
*              * CY_BLE_HIDS_REPORT - Report Characteristic
*
*  \param attrSize: The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the characteristic value data that should be
*               stored in the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSS_SetCharacteristicValue(uint8_t serviceIndex,
                                                           cy_en_ble_hids_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_ble_gatt_db_attr_handle_t charValueHandle;

    if((serviceIndex >= CY_BLE_HIDSS_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        switch(charIndex)
        {
            case CY_BLE_HIDS_PROTOCOL_MODE:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].protocolModeHandle;
                break;

            case CY_BLE_HIDS_REPORT_MAP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].reportMapHandle;
                break;

            case CY_BLE_HIDS_INFORMATION:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].informationHandle;
                break;

            case CY_BLE_HIDS_CONTROL_POINT:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].controlPointHandle;
                break;

            case CY_BLE_HIDS_BOOT_KYBRD_IN_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX].reportHandle;
                break;

            case CY_BLE_HIDS_BOOT_KYBRD_OUT_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_OUT_REP_INDX].reportHandle;
                break;

            case CY_BLE_HIDS_BOOT_MOUSE_IN_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX].reportHandle;
                break;

            default:                    /* Report characteristic */
                /* Verify that requested report exists in particular service */
                if(((uint8_t)charIndex - (uint8_t)CY_BLE_HIDS_REPORT) <
                   cy_ble_hidsConfigPtr->hidss[serviceIndex].reportCount)
                {
                    charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                       reportArray[charIndex - CY_BLE_HIDS_REPORT].reportHandle;
                }
                else
                {
                    charValueHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                }
                break;
        }
        if(charValueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Store data in database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = charValueHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .offset                     = 0u,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets local characteristic value of the specified HID Service characteristics.
*
*  \param serviceIndex: The index of the service instance. e.g. If two HID Services are
*                 supported in your design, then first service will be identified
*                 by serviceIndex of 0 and the second by serviceIndex of 1.
*
*  \param charIndex: The index of the service characteristic.
*              * CY_BLE_HIDS_PROTOCOL_MODE - Protocol Mode characteristic
*              * CY_BLE_HIDS_REPORT_MAP - Report Map characteristic
*              * CY_BLE_HIDS_INFORMATION - HID Information characteristic
*              * CY_BLE_HIDS_CONTROL_POINT - HID Control Point characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_IN_REP - Boot Keyboard Input Report Characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_OUT_REP - Boot Keyboard Output Report Characteristic
*              * CY_BLE_HIDS_BOOT_MOUSE_IN_REP - Boot Mouse Input Report Characteristic
*              * CY_BLE_HIDS_REPORT - Report Characteristic
*
*  \param attrSize: The size of the characteristic value attribute.
*
*  \param attrValue: The pointer to the location where characteristic value data
*               should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSS_GetCharacteristicValue(uint8_t serviceIndex,
                                                           cy_en_ble_hids_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_ble_gatt_db_attr_handle_t charValueHandle;

    if((serviceIndex >= CY_BLE_HIDSS_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        switch(charIndex)
        {
            case CY_BLE_HIDS_PROTOCOL_MODE:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].protocolModeHandle;
                break;

            case CY_BLE_HIDS_REPORT_MAP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].reportMapHandle;
                break;

            case CY_BLE_HIDS_INFORMATION:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].informationHandle;
                break;

            case CY_BLE_HIDS_CONTROL_POINT:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].controlPointHandle;
                break;

            case CY_BLE_HIDS_BOOT_KYBRD_IN_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX].reportHandle;
                break;

