ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
            case CY_BLE_HIDS_BOOT_KYBRD_OUT_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_OUT_REP_INDX].reportHandle;
                break;

            case CY_BLE_HIDS_BOOT_MOUSE_IN_REP:
                charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                   bootReportArray[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX].reportHandle;
                break;

            default:                    /* Report characteristic */
                /* Verify that requested report exists in particular service */
                if(((uint8_t)charIndex - (uint8_t)CY_BLE_HIDS_REPORT) <
                   cy_ble_hidsConfigPtr->hidss[serviceIndex].reportCount)
                {
                    charValueHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].
                                       reportArray[charIndex - CY_BLE_HIDS_REPORT].reportHandle;
                }
                else
                {
                    charValueHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                }
                break;
        }

        if(charValueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Read characteristic value from database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = charValueHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets local characteristic descriptor of the specified HID Service
*  characteristic.
*
*  \param connHandle: BLE peer device connection handle.
*  \param serviceIndex: The index of the service instance. e.g. If two HID Services are
*                 supported in your design, then first service will be identified
*                 by serviceIndex of 0 and the second by serviceIndex of 1.
*
*  \param charIndex: The index of the characteristic.
*              * CY_BLE_HIDS_REPORT_MAP          - Report Map Characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_IN_REP   - Boot Keyboard Input Report Characteristic
*              * CY_BLE_HIDS_BOOT_KYBRD_OUT_REP  - Boot Keyboard Output Report Characteristic
*              * CY_BLE_HIDS_BOOT_MOUSE_IN_REP   - Boot Mouse Input Report Characteristic
*              * CY_BLE_HIDS_REPORT              - Report Characteristic
*
*  \param descrIndex: The index of the descriptor.
*               * CY_BLE_HIDS_REPORT_CCCD - Client Characteristic Configuration descriptor
*               * CY_BLE_HIDS_REPORT_RRD - Report Reference descriptor
*               * CY_BLE_HIDS_REPORT_MAP_ERRD - Report Map External Report Reference descriptor
*
*  \param attrSize: The size of the descriptor value attribute.
*
*  \param attrValue: The pointer to the location where characteristic descriptor
*               value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                uint8_t serviceIndex,
                                                                cy_en_ble_hids_char_index_t charIndex,
                                                                cy_en_ble_hids_descr_t descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_ble_gatt_db_attr_handle_t locDescrHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    const cy_stc_ble_hidss_report_t *locReport;

    if((serviceIndex >= CY_BLE_HIDSS_SERVICE_COUNT) || (descrIndex >= CY_BLE_HIDS_DESCR_COUNT) ||
       (charIndex >= CY_BLE_HIDS_CHAR_COUNT) || (charIndex < CY_BLE_HIDS_REPORT_MAP) ||
       (charIndex == CY_BLE_HIDS_BOOT_KYBRD_OUT_REP))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(charIndex == CY_BLE_HIDS_REPORT_MAP)
        {
            if(descrIndex == CY_BLE_HIDS_REPORT_MAP_ERRD)
            {
                locDescrHandle = cy_ble_hidsConfigPtr->hidss[serviceIndex].reportMapErrdHandle;
            }
            else
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
        else /* Report characteristics */
        {
            /* Get report structure */
            if((charIndex >= CY_BLE_HIDS_BOOT_KYBRD_IN_REP) && (charIndex <= CY_BLE_HIDS_BOOT_MOUSE_IN_REP))
            {
                locReport = &cy_ble_hidsConfigPtr->hidss[serviceIndex].
                             bootReportArray[charIndex - CY_BLE_HIDS_BOOT_KYBRD_IN_REP];
            }
            else
            {
                locReport = &cy_ble_hidsConfigPtr->hidss[serviceIndex].reportArray[charIndex - CY_BLE_HIDS_REPORT];
            }
            /* Get descriptor handle from report structure */
            if(descrIndex == CY_BLE_HIDS_REPORT_CCCD)
            {
                locDescrHandle = locReport->cccdHandle;
            }
            else if(descrIndex == CY_BLE_HIDS_REPORT_RRD)
            {
                locDescrHandle = locReport->rrdHandle;
            }
            else /* External Report Reference descriptor doesn't exist for report characteristic */
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }
    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
    {
        if(locDescrHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
        else
        {
            /* Read value from database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = locDescrHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .connHandle                 = connHandle,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };

            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
    }

    return(apiResult);
}


