ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/******************************************************************************
* Function Name: Cy_BLE_HIDSS_CccdWriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event of the Client Characteristic Configuration
*  descriptor.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  uint32_t eventCode: The event code to be send to application.
*
******************************************************************************/
static uint32_t Cy_BLE_HIDSS_CccdWriteEventHandler(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    uint32_t eventCode;

    if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
    {
        eventCode = (uint32_t)CY_BLE_EVT_HIDSS_NOTIFICATION_ENABLED;
    }
    else
    {
        eventCode = (uint32_t)CY_BLE_EVT_HIDSS_NOTIFICATION_DISABLED;
    }
    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
    /* Set flag to store bonding data to flash */
    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
    {
        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
    }
#endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

    return(eventCode);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write is successful.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_HIDSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint8_t locServIndex = 0u;
    uint32_t reportIndex;
    cy_en_ble_hids_char_index_t locCharIndex;
    cy_stc_ble_hids_char_value_t locCharValue;
    uint32_t eventCode = 0u;

    if(Cy_BLE_HIDS_ApplCallback != NULL)
    {
        locCharValue.connHandle = eventParam->connHandle;
        locCharValue.value = NULL;
        do
        {
            locCharValue.serviceIndex = locServIndex;
            /* Protocol Mode characteristic write request */
            if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].protocolModeHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_PROTOCOL_MODE;
                if(eventParam->handleValPair.value.len == CY_BLE_HIDS_PM_CHAR_LEN)
                {
                    switch(eventParam->handleValPair.value.val[0u])
                    {
                        case CY_BLE_HIDS_PROTOCOL_MODE_BOOT:
                            eventCode = (uint32_t)CY_BLE_EVT_HIDSS_BOOT_MODE_ENTER;
                            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                            break;

                        case CY_BLE_HIDS_PROTOCOL_MODE_REPORT:
                            eventCode = (uint32_t)CY_BLE_EVT_HIDSS_REPORT_MODE_ENTER;
                            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                            break;

                        default:    /* Reserved for Future Use. */
                            break;
                    }
                }
            }
            /* Control Point characteristic write request */
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].controlPointHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_CONTROL_POINT;
                if(eventParam->handleValPair.value.len == CY_BLE_HIDS_CP_CHAR_LEN)
                {
                    switch(eventParam->handleValPair.value.val[0u])
                    {
                        case CY_BLE_HIDS_CP_SUSPEND:
                            eventCode = (uint32_t)CY_BLE_EVT_HIDSS_SUSPEND;
                            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                            break;

                        case CY_BLE_HIDS_CP_EXIT_SUSPEND:
                            eventCode = (uint32_t)CY_BLE_EVT_HIDSS_EXIT_SUSPEND;
                            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                            break;

                        default:    /* Reserved for Future Use. */
                            break;
                    }
                }
            }
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].
                     bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX].reportHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_BOOT_KYBRD_IN_REP;
                locCharValue.value = &eventParam->handleValPair.value;
                eventCode = (uint32_t)CY_BLE_EVT_HIDSS_REPORT_WRITE_CHAR;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].
                     bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX].cccdHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_BOOT_KYBRD_IN_REP;
                eventCode = Cy_BLE_HIDSS_CccdWriteEventHandler(eventParam);
            }
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].
                     bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_OUT_REP_INDX].reportHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_BOOT_KYBRD_OUT_REP;
                locCharValue.value = &eventParam->handleValPair.value;
                eventCode = (uint32_t)CY_BLE_EVT_HIDSS_REPORT_WRITE_CHAR;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].
                     bootReportArray[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX].reportHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_BOOT_MOUSE_IN_REP;
                locCharValue.value = &eventParam->handleValPair.value;
                eventCode = (uint32_t)CY_BLE_EVT_HIDSS_REPORT_WRITE_CHAR;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
            else if(eventParam->handleValPair.attrHandle == cy_ble_hidsConfigPtr->hidss[locServIndex].
                     bootReportArray[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX].cccdHandle)
            {
                locCharValue.charIndex = CY_BLE_HIDS_BOOT_MOUSE_IN_REP;
                eventCode = Cy_BLE_HIDSS_CccdWriteEventHandler(eventParam);
            }
            else
            {
                uint8_t locReqHandle = 0u;

                locCharIndex = CY_BLE_HIDS_REPORT;
                for(reportIndex = 0u; (reportIndex < cy_ble_hidsConfigPtr->hidss[locServIndex].reportCount) &&
                    (locReqHandle == 0u); reportIndex++)
                {
                    if(eventParam->handleValPair.attrHandle ==
                       cy_ble_hidsConfigPtr->hidss[locServIndex].reportArray[reportIndex].reportHandle)
                    {
                        locCharValue.charIndex = locCharIndex;
                        locCharValue.value = &eventParam->handleValPair.value;
                        eventCode = (uint32_t)CY_BLE_EVT_HIDSS_REPORT_WRITE_CHAR;
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                        locReqHandle = 1u;
                    }
                    if(eventParam->handleValPair.attrHandle ==
                       cy_ble_hidsConfigPtr->hidss[locServIndex].reportArray[reportIndex].cccdHandle)
                    {
                        locCharValue.charIndex = locCharIndex;
                        eventCode = Cy_BLE_HIDSS_CccdWriteEventHandler(eventParam);
                        locReqHandle = 1u;
                    }
                    locCharIndex++;
                }
            }
            locServIndex++;

            /* Store data to database if event is handled */
            if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair.attrHandle = eventParam->handleValPair.attrHandle,
                    .handleValuePair.value.len  = eventParam->handleValPair.value.len,
                    .handleValuePair.value.val  = eventParam->handleValPair.value.val,
                    .offset                     = 0u,
                    .connHandle                 = eventParam->connHandle,
                    .flags                      = CY_BLE_GATT_DB_PEER_INITIATED
                };

                gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                if(gattErr == CY_BLE_GATT_ERR_NONE)
                {
                    Cy_BLE_HIDS_ApplCallback(eventCode, &locCharValue);
                }
                break;
            }
        }
        while(locServIndex < CY_BLE_HIDSS_SERVICE_COUNT);
    }

    return(gattErr);
}


