ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/******************************************************************************
* Function Name: Cy_BLE_HIDSS_SendNotification
***************************************************************************//**
*
*  Sends specified HID Service characteristic notification to the Client device.
*
*  CY_BLE_EVT_HIDSC_NOTIFICATION event is received by the peer device, on invoking
*   this function.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  'Handle Value Notification' which results in CY_BLE_EVT_HIDSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle: BLE peer device connection handle.
*  \param serviceIndex: The index of the HID service instance. e.g. If two HID Services
*                 are supported in your design, then first service will be
*                 identified by serviceIndex of 0 and the second by serviceIndex
*                 of 1.
*  \param charIndex: The index of the service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: Pointer to the characteristic value data that should be sent to
*               the Client device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*   * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the client is not established
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the client.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                     uint8_t serviceIndex,
                                                     cy_en_ble_hids_char_index_t charIndex,
                                                     uint8_t attrSize,
                                                     uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    const cy_stc_ble_hidss_report_t *locReport;

    if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((serviceIndex >= CY_BLE_HIDSS_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        if(charIndex == CY_BLE_HIDS_BOOT_KYBRD_IN_REP)
        {
            locReport = &cy_ble_hidsConfigPtr->hidss[serviceIndex].bootReportArray[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX];
        }
        else if(charIndex == CY_BLE_HIDS_BOOT_MOUSE_IN_REP)
        {
            locReport = &cy_ble_hidsConfigPtr->hidss[serviceIndex].bootReportArray[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX];
        }
        else if((charIndex >= CY_BLE_HIDS_REPORT) && (charIndex <= CY_BLE_HIDS_REPORT_END))
        {
            /* Verify that requested report exists in particular service */
            if(((uint8_t)charIndex - (uint8_t)CY_BLE_HIDS_REPORT) < cy_ble_hidsConfigPtr->hidss[serviceIndex].reportCount)
            {
                locReport = &cy_ble_hidsConfigPtr->hidss[serviceIndex].reportArray[charIndex - CY_BLE_HIDS_REPORT];
            }
            else
            {
                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
        if(apiResult == CY_BLE_SUCCESS)
        {
            if(locReport->reportHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
            }
            else
            {
                /* Send Notification if it is enabled */
                if(CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, locReport->cccdHandle))
                {
                    /* Fill all fields of write request structure ... */
                    cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
                    {
                        .handleValPair.attrHandle = locReport->reportHandle,
                        .handleValPair.value.val  = attrValue,
                        .handleValPair.value.len  = attrSize,
                        .connHandle               = connHandle
                    };

                    /* Send notification to client using previously filled structure */
                    apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
                }
                else
                {
                    apiResult = CY_BLE_ERROR_NTF_DISABLED;
                }
            }
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSS_OnDeviceConnected
***************************************************************************//**
*
*  Handles the connection establishment request.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_HIDSS_OnDeviceConnected(void)
{
    /* The Protocol Mode characteristic value shall be reset to the default value
     * following a connection establishment */
    uint8_t defaultProtocol = CY_BLE_HIDS_PROTOCOL_DEFAULT;
    uint8_t locServIndex = 0u;

    do
    {
        if(cy_ble_hidsConfigPtr->hidss[locServIndex].protocolModeHandle !=
           CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            /* Store default protocol value in database */
            CY_BLE_GATT_DB_ATTR_SET_GEN_VALUE(cy_ble_hidsConfigPtr->hidss[locServIndex].protocolModeHandle,
                                              &defaultProtocol, sizeof(defaultProtocol));
        }
        ++locServIndex;
    }
    while(locServIndex < CY_BLE_HIDSS_SERVICE_COUNT);
}


