ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
#endif /* CY_BLE_HIDS_SERVER */

#ifdef CY_BLE_HIDS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_InclDiscoveryEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP event
*  Based on the service UUID, an appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*  \param discoveryService: The index of the service instance.
*
*
******************************************************************************/
static void Cy_BLE_HIDSC_InclDiscoveryEventHandler(const cy_stc_ble_disc_incl_info_t *discInclInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discInclInfo->connHandle);
    uint32_t discoveryService = cy_ble_discovery[discIdx].servCount - CY_BLE_SRVI_HIDS;

    if((discInclInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_HIDS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_HIDS_END))
    {
        cy_ble_hidsc[discIdx][discoveryService].includeHandle = discInclInfo->inclDefHandle;

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP event
*  Based on the service UUID, an appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_HIDSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    static cy_ble_gatt_db_attr_handle_t *lastEndHandle[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
    static uint32_t discoveryLastServ[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);
    uint32_t discoveryService = cy_ble_discovery[discIdx].servCount - CY_BLE_SRVI_HIDS;

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_HIDS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_HIDS_END))
    {
        /* Update last characteristic endHandle to declaration handle of this characteristic */
        if(lastEndHandle[discIdx] != NULL)
        {
            if(discoveryLastServ[discIdx] == discoveryService)
            {
                *lastEndHandle[discIdx] = discCharInfo->charDeclHandle - 1u;
            }
            lastEndHandle[discIdx] = NULL;
        }

        switch(discCharInfo->uuid.uuid16)
        {
            case CY_BLE_UUID_CHAR_HIDS_PROTOCOL_MODE:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].protocolMode);
                break;

            case CY_BLE_UUID_CHAR_HIDS_INFORMATION:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].information);
                break;

            case CY_BLE_UUID_CHAR_HIDS_REPORT_MAP:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].reportMap);
                lastEndHandle[discIdx] = &cy_ble_hidsc[discIdx][discoveryService].reportMap.endHandle;
                break;

            case CY_BLE_UUID_CHAR_HIDS_CONTROL_POINT:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].controlPoint);
                break;

            case CY_BLE_UUID_CHAR_HIDS_REPORT:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].
                                             report[cy_ble_hidsc[discIdx][discoveryService].reportCount]);
                lastEndHandle[discIdx] = &cy_ble_hidsc[discIdx][discoveryService].
                                          report[cy_ble_hidsc[discIdx][discoveryService].reportCount].endHandle;

                if(cy_ble_hidsc[discIdx][discoveryService].reportCount < CY_BLE_HIDSC_REPORT_COUNT)
                {
                    cy_ble_hidsc[discIdx][discoveryService].reportCount++;
                }
                break;

            case CY_BLE_UUID_CHAR_HIDS_BOOT_KEYBOARD_IN_RPT:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].
                                             bootReport[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX]);
                lastEndHandle[discIdx] = &cy_ble_hidsc[discIdx][discoveryService].
                                          bootReport[CY_BLE_HIDS_BOOT_KYBRD_IN_REP_INDX].endHandle;
                break;

            case CY_BLE_UUID_CHAR_HIDS_BOOT_KEYBOARD_OUT_RPT:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].
                                             bootReport[CY_BLE_HIDS_BOOT_KYBRD_OUT_REP_INDX]);
                lastEndHandle[discIdx] = &cy_ble_hidsc[discIdx][discoveryService].
                                          bootReport[CY_BLE_HIDS_BOOT_KYBRD_OUT_REP_INDX].endHandle;
                break;

            case CY_BLE_UUID_CHAR_HIDS_BOOT_MOUSE_IN_RPT:
                Cy_BLE_CheckStoreCharHandle(cy_ble_hidsc[discIdx][discoveryService].
                                             bootReport[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX]);
                lastEndHandle[discIdx] = &cy_ble_hidsc[discIdx][discoveryService].
                                          bootReport[CY_BLE_HIDS_BOOT_MOUSE_IN_REP_INDX].endHandle;
                break;

            default:
                break;
        }
        /* Init characteristic endHandle to Service endHandle.
         * Characteristic endHandle will be updated to the declaration
         * Handler of the following characteristic, in the following characteristic discovery procedure. */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle;
            /* Init service index of discovered characteristic */
            discoveryLastServ[discIdx] = discoveryService;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


