ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/******************************************************************************
* Function Name: Cy_BLE_HIDSC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_FIND_INFO_RSP event.
*  This event is generated when the server successfully sends the data for
*  CY_BLE_EVT_GATTC_FIND_INFO_REQ. Based on the service UUID, an appropriate data
*  structure is populated to the service with a service callback.
*
*  \param discDescrInfo: The pointer to a descriptor information structure.
*  \param discoveryService: The index of the service instance.
*
******************************************************************************/
static void Cy_BLE_HIDSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);
    uint32_t hidsServIdx = cy_ble_discovery[discIdx].servCount - (uint32_t)CY_BLE_SRVI_HIDS;

    if((cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_HIDS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_HIDS_END))
    {
        switch((cy_en_ble_hids_char_index_t)cy_ble_discovery[discIdx].charCount)
        {
            case CY_BLE_HIDS_REPORT_MAP:
                /* Descriptors for reportMap characteristics */
                if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_EXTERNAL_REPORT_REF)
                {
                    Cy_BLE_CheckStoreCharDescrHandle(cy_ble_hidsc[discIdx][hidsServIdx].reportMap.errdHandle);
                }
                break;

            case CY_BLE_HIDS_BOOT_KYBRD_IN_REP:
            case CY_BLE_HIDS_BOOT_KYBRD_OUT_REP:
            case CY_BLE_HIDS_BOOT_MOUSE_IN_REP:
            {
                /* Descriptors for report characteristics */
                uint32_t bootRepIdx = cy_ble_discovery[discIdx].charCount - CY_BLE_HIDS_BOOT_KYBRD_IN_REP;
                if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_CLIENT_CONFIG)
                {
                    Cy_BLE_CheckStoreCharDescrHandle(cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].
                                                      cccdHandle);
                }
                else if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_REPORT_REFERENCE)
                {
                    Cy_BLE_CheckStoreCharDescrHandle(cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].
                                                      rrdHandle);
                }
                else        /* Report Characteristic doesn't support other descriptors */
                {
                }
                break;
            }

            default:
            {
                if((cy_ble_discovery[discIdx].charCount >= (uint32_t)CY_BLE_HIDS_REPORT) &&
                   (cy_ble_discovery[discIdx].charCount <= (uint32_t)CY_BLE_HIDS_REPORT_END))
                {
                    /* Descriptors for report characteristics */
                    uint32_t reportIdx = cy_ble_discovery[discIdx].charCount - (uint32_t)CY_BLE_HIDS_REPORT;

                    if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_CLIENT_CONFIG)
                    {
                        Cy_BLE_CheckStoreCharDescrHandle(cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].
                                                          cccdHandle);
                    }
                    else if(discDescrInfo->uuid.uuid16 == CY_BLE_UUID_CHAR_REPORT_REFERENCE)
                    {
                        Cy_BLE_CheckStoreCharDescrHandle(cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].
                                                          rrdHandle);
                    }
                    else        /* Report Characteristic doesn't support other descriptors */
                    {
                    }
                }
                break;
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_GetCharRange
***************************************************************************//**
*
* Returns a possible range of the current characteristic descriptor via
* input parameter charRangeInfo->range
*
* \param *charRangeInfo: The pointer to a descriptor range information structure.
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_HIDSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(charRangeInfo->connHandle);
    uint32_t hidsServIdx = cy_ble_discovery[discIdx].servCount - (uint32_t)CY_BLE_SRVI_HIDS;
    uint32_t exitFlag = 0u;

    if((cy_ble_discovery[discIdx].servCount >= (uint32_t)CY_BLE_SRVI_HIDS) &&
       (cy_ble_discovery[discIdx].servCount <= (uint32_t)CY_BLE_SRVI_HIDS_END))
    {
        if(charRangeInfo->srviIncIdx != CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].charCount++;
        }

        while((cy_ble_discovery[discIdx].charCount < (uint32_t)CY_BLE_HIDS_CHAR_COUNT) && (exitFlag == 0u))
        {
            switch((cy_en_ble_hids_char_index_t)cy_ble_discovery[discIdx].charCount)
            {
                case CY_BLE_HIDS_REPORT_MAP:
                    /* Read report map characteristic range */
                    if((cy_ble_hidsc[discIdx][hidsServIdx].reportMap.endHandle -
                        cy_ble_hidsc[discIdx][hidsServIdx].reportMap.valueHandle) != 0u)
                    {
                        charRangeInfo->range.startHandle = cy_ble_hidsc[discIdx][hidsServIdx].reportMap.valueHandle + 1u;
                        charRangeInfo->range.endHandle = cy_ble_hidsc[discIdx][hidsServIdx].reportMap.endHandle;
                        exitFlag = 1u;
                    }
                    break;

                case CY_BLE_HIDS_BOOT_KYBRD_IN_REP:
                case CY_BLE_HIDS_BOOT_KYBRD_OUT_REP:
                case CY_BLE_HIDS_BOOT_MOUSE_IN_REP:
                {
                    /* Read boot report characteristic range */
                    uint32_t bootRepIdx = cy_ble_discovery[discIdx].charCount - CY_BLE_HIDS_BOOT_KYBRD_IN_REP;

