ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
                    if((cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].endHandle -
                        cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].valueHandle) != 0u)
                    {
                        charRangeInfo->range.startHandle = cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].
                                                            valueHandle + 1u;
                        charRangeInfo->range.endHandle = cy_ble_hidsc[discIdx][hidsServIdx].bootReport[bootRepIdx].
                                                          endHandle;
                        exitFlag = 1u;
                    }
                    break;
                }

                default:
                {
                    if((cy_ble_discovery[discIdx].charCount >= (uint32_t)CY_BLE_HIDS_REPORT) &&
                       (cy_ble_discovery[discIdx].charCount <= (uint32_t)CY_BLE_HIDS_REPORT_END))
                    {
                        /* Read report characteristic range */
                        uint32_t reportIdx = cy_ble_discovery[discIdx].charCount - CY_BLE_HIDS_REPORT;
                        if((cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].endHandle -
                            cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].valueHandle) != 0u)
                        {
                            charRangeInfo->range.startHandle = cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].
                                                                valueHandle + 1u;
                            charRangeInfo->range.endHandle = cy_ble_hidsc[discIdx][hidsServIdx].report[reportIdx].
                                                              endHandle;
                            exitFlag = 1u;
                        }
                    }
                    break;
                }
            }

            if(exitFlag == 0u)
            {
                cy_ble_discovery[discIdx].charCount++;
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}
/******************************************************************************
* Function Name: Cy_BLE_HIDSC_SetCharacteristicValue
***************************************************************************//**
*
*  Sends a request to set characteristic value of the specified HID Service,
*  which is identified by serviceIndex and reportIndex, on the server device.
*  This function call can result in generation of the following events based on
*  the response from the server device:
*  * CY_BLE_EVT_HIDSC_WRITE_CHAR_RESPONSE
*  * CY_BLE_EVT_GATTC_ERROR_RSP
*
*  \param connHandle: The connection handle.
*  \param subProcedure: Characteristic value write sub-procedure.
*                 * CY_BLE_HIDSC_WRITE_WITHOUT_RESPONSE
*                 * CY_BLE_HIDSC_WRITE_CHAR_VALUE
*  \param serviceIndex: The index of the service instance. e.g. If two HID Services
*                 are supported in your design, then first service will be
*                 identified by serviceIndex of 0 and the second by
*                 serviceIndex of 1.
*  \param charIndex: The index of a service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*               sent to the server device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                               the particular characteristic
*  * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this
*                                     characteristic
*
* \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the HIDS service-specific callback is registered
*      (with Cy_BLE_HIDS_RegisterAttrCallback):
*  * CY_BLE_EVT_HIDSC_WRITE_CHAR_RESPONSE - in case if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, etc.) are
*                                provided with event parameter structure
*                                of type cy_stc_ble_hids_char_value_t.
*  .
*   Otherwise (if the HIDS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_WRITE_RSP - in case if the requested attribute is
*                                successfully written on the peer device.
*  * CY_BLE_EVT_GATTC_ERROR_RSP - in case if there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSC_SetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                           cy_en_ble_hidsc_char_write_t subProcedure,
                                                           uint8_t serviceIndex,
                                                           cy_en_ble_hids_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t * attrValue)
{
    cy_en_ble_api_result_t apiResult;
    cy_ble_gatt_db_attr_handle_t charValueHandle;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);
    
    if((serviceIndex >= CY_BLE_HIDSC_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT) || 
       (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        charValueHandle = Cy_BLE_HIDSC_GetCharacteristicValueHandle(connHandle, serviceIndex, charIndex);

