ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
        if(charValueHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            cy_stc_ble_gattc_write_cmd_req_t writeReqParam =
            {
                .handleValPair.attrHandle = charValueHandle,
                .handleValPair.value.val  = attrValue,
                .handleValPair.value.len  = attrSize,
                .connHandle               = connHandle
            };
            /* Use WriteWithoutResponse subprocedure for the following characteristics:
             * CY_BLE_HIDS_PROTOCOL_MODE
             * CY_BLE_HIDS_CONTROL_POINT
             */
            if(subProcedure == CY_BLE_HIDSC_WRITE_WITHOUT_RESPONSE)
            {
                apiResult = Cy_BLE_GATTC_WriteWithoutResponse(&writeReqParam);
            }
            else
            {
                apiResult = Cy_BLE_GATTC_WriteCharacteristicValue(&writeReqParam);
                /* Save handle to support service-specific write response from device */
                if(apiResult == CY_BLE_SUCCESS)
                {
                    cy_ble_hidscReqHandle[discIdx] = charValueHandle;
                }
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_GetCharacteristicValue
***************************************************************************//**
*
*  This function is used to read the characteristic value from a server
*  which is identified by charIndex.
*
*  The Read Response returns the characteristic value in the Attribute Value
*  parameter.
*
*  The Read Response only contains the characteristic value that is less than or
*  equal to (MTU - 1) octets in length. If the characteristic value is greater
*  than (MTU - 1) octets in length, the Read Long Characteristic Value procedure
*  may be used if the rest of the characteristic Value is required.
*
*  \param connHandle: The connection handle.
*  \param subProcedure: The characteristic value read sub-procedure.
*                * CY_BLE_HIDSC_READ_CHAR_VALUE
*                * CY_BLE_HIDSC_READ_LONG_CHAR_VALUE.
*  \param serviceIndex: The index of the service instance.
*  \param charIndex: The index of the service characteristic.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The read request was sent successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                               the particular characteristic
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed
*  * CY_BLE_ERROR_INVALID_STATE - Connection with the server is not established
*  * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this
*                                     characteristic
*
* \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the HIDS service-specific callback is registered
*      (with Cy_BLE_HIDS_RegisterAttrCallback):
*  * CY_BLE_EVT_HIDSC_READ_CHAR_RESPONSE - in case if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index , value, etc.) are
*                                provided with event parameter structure
*                                of type cy_stc_ble_hids_char_value_t.
*  .
*   Otherwise (if the HIDS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_RSP - in case if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_READ_BLOB_RSP - in case if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - in case if there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HIDSC_GetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                           cy_en_ble_hidsc_char_read_t subProcedure,
                                                           uint8_t serviceIndex,
                                                           cy_en_ble_hids_char_index_t charIndex)
{
    cy_en_ble_api_result_t apiResult;
    cy_ble_gatt_db_attr_handle_t charValueHandle;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((serviceIndex >= CY_BLE_HIDSC_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT) || 
            (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        charValueHandle = Cy_BLE_HIDSC_GetCharacteristicValueHandle(connHandle, serviceIndex, charIndex);

        if(charValueHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            /* Use Read Long Characteristic procedure for Report map characteristic */
            if(subProcedure == CY_BLE_HIDSC_READ_LONG_CHAR_VALUE)
            {
                cy_stc_ble_gattc_read_blob_req_t charReadLongParam =
                {
                    .handleOffset.attrHandle = charValueHandle,
                    .handleOffset.offset     = 0u,
                    .connHandle              = connHandle
                };

                apiResult = Cy_BLE_GATTC_ReadLongCharacteristicValues(&charReadLongParam);
            }
            else
            {
                cy_stc_ble_gattc_read_req_t readReqParam =
                {
                    .attrHandle = charValueHandle,
                    .connHandle = connHandle
                };

                apiResult = Cy_BLE_GATTC_ReadCharacteristicValue(&readReqParam);
            }
            /* Save handle to support service-specific read response from device */
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_hidscReqHandle[discIdx] = charValueHandle;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


