ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
        if(readReqParam.attrHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            readReqParam.connHandle = connHandle;
            apiResult = Cy_BLE_GATTC_ReadCharacteristicDescriptors(&readReqParam);
            /* Save handle to support service-specific read response from device */
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_hidscReqHandle[discIdx] = readReqParam.attrHandle;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles the Notification Event.
*
*  \param eventParam:  pointer to the data structure specified by the event.
*
*
******************************************************************************/
static void Cy_BLE_HIDSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint8_t locServIndex;
    cy_en_ble_hids_char_index_t locCharIndex;

    if(Cy_BLE_HIDS_ApplCallback != NULL)
    {
        for(locServIndex = 0u; locServIndex < CY_BLE_HIDSC_SERVICE_COUNT; locServIndex++)
        {
            for(locCharIndex = CY_BLE_HIDS_PROTOCOL_MODE; locCharIndex < CY_BLE_HIDS_CHAR_COUNT; locCharIndex++)
            {
                if(Cy_BLE_HIDSC_GetCharacteristicValueHandle(eventParam->connHandle, locServIndex, locCharIndex) ==
                   eventParam->handleValPair.attrHandle)
                {
                    cy_stc_ble_hids_char_value_t notifValue =
                    {
                        .connHandle   = eventParam->connHandle,
                        .serviceIndex = locServIndex,
                        .charIndex    = locCharIndex,
                        .value        = &eventParam->handleValPair.value
                    };

                    Cy_BLE_HIDS_ApplCallback((uint32_t)CY_BLE_EVT_HIDSC_NOTIFICATION, &notifValue);
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    break;
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param eventParam:  pointer to the data structure specified by the event.
*
*
******************************************************************************/
static void Cy_BLE_HIDSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint8_t locReqHandle = 0u;
    uint8_t locServIndex;
    cy_en_ble_hids_char_index_t locCharIndex;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_HIDS_ApplCallback != NULL) &&
       (CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_hidscReqHandle[discIdx]))
    {
        for(locServIndex = 0u; (locServIndex < CY_BLE_HIDSC_SERVICE_COUNT) && (locReqHandle == 0u); locServIndex++)
        {
            for(locCharIndex = CY_BLE_HIDS_PROTOCOL_MODE; (locCharIndex < CY_BLE_HIDS_CHAR_COUNT) && (locReqHandle == 0u);
                locCharIndex++)
            {
                if(cy_ble_hidscReqHandle[discIdx] ==
                   Cy_BLE_HIDSC_GetCharacteristicValueHandle(eventParam->connHandle, locServIndex, locCharIndex))
                {
                    cy_stc_ble_hids_char_value_t locCharValue =
                    {
                        .connHandle   = eventParam->connHandle,
                        .serviceIndex = locServIndex,
                        .charIndex    = locCharIndex,
                        .value        = &eventParam->value
                    };

                    cy_ble_hidscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    Cy_BLE_HIDS_ApplCallback((uint32_t)CY_BLE_EVT_HIDSC_READ_CHAR_RESPONSE, &locCharValue);
                    locReqHandle = 1u;
                }
                if(locCharIndex >= CY_BLE_HIDS_REPORT_MAP)
                {
                    cy_en_ble_hids_descr_t locDescIndex;

                    for(locDescIndex = CY_BLE_HIDS_REPORT_CCCD; (locDescIndex < CY_BLE_HIDS_DESCR_COUNT) &&
                        (locReqHandle == 0u); locDescIndex++)
                    {
                        if(cy_ble_hidscReqHandle[discIdx] ==
                           Cy_BLE_HIDSC_GetCharacteristicDescriptorHandle(eventParam->connHandle, locServIndex,
                                                                          locCharIndex, locDescIndex))
                        {
                            cy_stc_ble_hids_descr_value_t locDescrValue =
                            {
                                .connHandle   = eventParam->connHandle,
                                .serviceIndex = locServIndex,
                                .charIndex    = locCharIndex,
                                .descrIndex   = locDescIndex,
                                .value        = &eventParam->value,
                            };

                            cy_ble_hidscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                            Cy_BLE_HIDS_ApplCallback((uint32_t)CY_BLE_EVT_HIDSC_READ_DESCR_RESPONSE, &locDescrValue);
                            locReqHandle = 1u;
                        }
                    }
                }
            }
        }
        if(locReqHandle != 0u)
        {
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_WriteResponseEventHandler
***************************************************************************//**
*  Handles the Write Response Event.
*
*  \param eventParam:  the pointer to the data structure specified by the event.
*
*
******************************************************************************/
static void Cy_BLE_HIDSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint8_t locServIndex;
    uint8_t locReqHandle = 0u;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);
    cy_en_ble_hids_char_index_t locCharIndex;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_HIDS_ApplCallback != NULL) &&
       (CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_hidscReqHandle[discIdx]))
    {
        for(locServIndex = 0u; (locServIndex < CY_BLE_HIDSC_SERVICE_COUNT) && (locReqHandle == 0u); locServIndex++)
        {
            for(locCharIndex = CY_BLE_HIDS_PROTOCOL_MODE; (locCharIndex < CY_BLE_HIDS_CHAR_COUNT) && (locReqHandle == 0u);
                locCharIndex++)
            {
                if(cy_ble_hidscReqHandle[discIdx] == Cy_BLE_HIDSC_GetCharacteristicValueHandle(*eventParam, locServIndex,
                                                                                               locCharIndex))
                {
                    cy_stc_ble_hids_char_value_t locCharValue =
                    {
                        .connHandle   = *eventParam,
                        .serviceIndex = locServIndex,
                        .charIndex    = locCharIndex,
                        .value        = NULL
                    };

                    cy_ble_hidscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    Cy_BLE_HIDS_ApplCallback((uint32_t)CY_BLE_EVT_HIDSC_WRITE_CHAR_RESPONSE, &locCharValue);
                    locReqHandle = 1u;
                }
                if(locCharIndex >= CY_BLE_HIDS_REPORT_MAP)
                {
                    cy_en_ble_hids_descr_t locDescIndex;

                    for(locDescIndex = CY_BLE_HIDS_REPORT_CCCD; (locDescIndex < CY_BLE_HIDS_DESCR_COUNT) &&
                        (locReqHandle == 0u); locDescIndex++)
                    {
                        if(cy_ble_hidscReqHandle[discIdx] ==
                           Cy_BLE_HIDSC_GetCharacteristicDescriptorHandle(*eventParam, locServIndex, locCharIndex,
                                                                          locDescIndex))
                        {
                            cy_stc_ble_hids_descr_value_t locDescrValue =
                            {
                                .connHandle   = *eventParam,
                                .serviceIndex = locServIndex,
                                .charIndex    = locCharIndex,
                                .descrIndex   = locDescIndex,
                                .value        = NULL
                            };

                            cy_ble_hidscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                            Cy_BLE_HIDS_ApplCallback((uint32_t)CY_BLE_EVT_HIDSC_WRITE_DESCR_RESPONSE, &locDescrValue);
                            locReqHandle = 1u;
                        }
                    }
                }
            }
        }
        if(locReqHandle != 0u)
        {
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


