ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hids.c
/******************************************************************************
* Function Name: Cy_BLE_HIDSC_GetCharacteristicValueHandle
***************************************************************************//**
*
*  Returns the discovered peer device characteristic value handle.
*
*  \param serviceIndex: The index of the service instance.
*  \param charIndex: The index of a service characteristic.
*
* \return
*  Returns characteristic value handle of type cy_ble_gatt_db_attr_handle_t.
*  * CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE: when a peer device doesn't have an optional characteristic
*
******************************************************************************/
cy_ble_gatt_db_attr_handle_t Cy_BLE_HIDSC_GetCharacteristicValueHandle(cy_stc_ble_conn_handle_t connHandle,
                                                                       uint8_t serviceIndex,
                                                                       cy_en_ble_hids_char_index_t charIndex)
{
    cy_ble_gatt_db_attr_handle_t returnHandle;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if((serviceIndex >= CY_BLE_HIDSC_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT))
    {
        returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    }
    else
    {
        if(charIndex == CY_BLE_HIDS_PROTOCOL_MODE)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].protocolMode.valueHandle;
        }
        else if(charIndex == CY_BLE_HIDS_INFORMATION)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].information.valueHandle;
        }
        else if(charIndex == CY_BLE_HIDS_CONTROL_POINT)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].controlPoint.valueHandle;
        }
        else if(charIndex == CY_BLE_HIDS_REPORT_MAP)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].reportMap.valueHandle;
        }
        else if(charIndex <= CY_BLE_HIDS_BOOT_MOUSE_IN_REP)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].bootReport[charIndex - CY_BLE_HIDS_BOOT_KYBRD_IN_REP].
                            valueHandle;
        }
        else if(((uint8_t)charIndex - (uint8_t)CY_BLE_HIDS_REPORT) < cy_ble_hidsc[discIdx][(serviceIndex)].reportCount)
        {
            returnHandle = cy_ble_hidsc[discIdx][serviceIndex].report[charIndex - CY_BLE_HIDS_REPORT].valueHandle;
        }
        else
        {
            returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }

    return(returnHandle);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_GetCharacteristicDescriptorHandle
***************************************************************************//**
*
*  Returns the discovered peer device characteristic descriptor handle.
*
*  \param serviceIndex:    the index of the service instance
*  \param charIndex:       the index of a service characteristic.
*  \param descrIndex:      the index of the descriptor.
*
* \return
*  Returns characteristic value handle of type cy_ble_gatt_db_attr_handle_t.
*  * CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE: when a peer device doesn't have an optional descriptor
*
******************************************************************************/
cy_ble_gatt_db_attr_handle_t Cy_BLE_HIDSC_GetCharacteristicDescriptorHandle(cy_stc_ble_conn_handle_t connHandle,
                                                                            uint8_t serviceIndex,
                                                                            cy_en_ble_hids_char_index_t charIndex,
                                                                            cy_en_ble_hids_descr_t descrIndex)
{
    cy_ble_gatt_db_attr_handle_t returnHandle;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if((serviceIndex >= CY_BLE_HIDSC_SERVICE_COUNT) || (charIndex >= CY_BLE_HIDS_CHAR_COUNT) ||
       (charIndex < CY_BLE_HIDS_REPORT_MAP))
    {
        returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    }
    else
    {
        if(charIndex == CY_BLE_HIDS_REPORT_MAP)
        {
            if(descrIndex == CY_BLE_HIDS_REPORT_MAP_ERRD)
            {
                returnHandle = cy_ble_hidsc[discIdx][serviceIndex].reportMap.errdHandle;
            }
            else
            {
                returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
        else if(charIndex <= CY_BLE_HIDS_BOOT_MOUSE_IN_REP)
        {
            if(descrIndex == CY_BLE_HIDS_REPORT_CCCD)
            {
                returnHandle = cy_ble_hidsc[discIdx][serviceIndex].bootReport[charIndex - CY_BLE_HIDS_BOOT_KYBRD_IN_REP].
                                cccdHandle;
            }
            else if(descrIndex == CY_BLE_HIDS_REPORT_RRD)
            {
                returnHandle = cy_ble_hidsc[discIdx][serviceIndex].bootReport[charIndex - CY_BLE_HIDS_BOOT_KYBRD_IN_REP].
                                rrdHandle;
            }
            else
            {
                returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
        else if(((uint8_t)charIndex - (uint8_t)CY_BLE_HIDS_REPORT) < cy_ble_hidsc[discIdx][serviceIndex].reportCount)
        {
            if(descrIndex == CY_BLE_HIDS_REPORT_CCCD)
            {
                returnHandle = cy_ble_hidsc[discIdx][serviceIndex].report[charIndex - CY_BLE_HIDS_REPORT].cccdHandle;
            }
            else if(descrIndex == CY_BLE_HIDS_REPORT_RRD)
            {
                returnHandle = cy_ble_hidsc[discIdx][serviceIndex].report[charIndex - CY_BLE_HIDS_REPORT].rrdHandle;
            }
            else
            {
                returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
        else
        {
            returnHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }

    return(returnHandle);
}


/******************************************************************************
* Function Name: Cy_BLE_HIDSC_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles the Error Response Event.
*
*  \param eventParam:  the pointer to the data structure specified by the event.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_HIDSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    if(eventParam != NULL)
    {
        if(cy_ble_hidscReqHandle[Cy_BLE_GetDiscoveryIdx(eventParam->connHandle)] == eventParam->errInfo.attrHandle)
        {
            cy_ble_hidscReqHandle[Cy_BLE_GetDiscoveryIdx(eventParam->connHandle)] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


#endif /* CY_BLE_HIDS_CLIENT */


